; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-27)
(:domain gripper-strips)
(:objects rooma roomb room3 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
)
)
)

; plan
1. (pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 9 of 27
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 27
3. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 10 of 27
4. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 10 of 27
5. (pick ball27 room3 left)
   deleted: (at ball27 room3) (free left)
   added: (carry ball27 left)
   goals met: 10 of 27
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 10 of 27
7. (drop ball27 roomb left)
   deleted: (carry ball27 left)
   added: (at ball27 roomb) (free left)
   goals met: 11 of 27
8. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 11 of 27
9. (pick ball26 room3 left)
   deleted: (at ball26 room3) (free left)
   added: (carry ball26 left)
   goals met: 11 of 27
10. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 11 of 27
11. (drop ball26 roomb left)
   deleted: (carry ball26 left)
   added: (at ball26 roomb) (free left)
   goals met: 12 of 27
12. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 12 of 27
13. (pick ball25 room3 left)
   deleted: (at ball25 room3) (free left)
   added: (carry ball25 left)
   goals met: 12 of 27
14. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 12 of 27
15. (drop ball25 roomb left)
   deleted: (carry ball25 left)
   added: (at ball25 roomb) (free left)
   goals met: 13 of 27
16. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 13 of 27
17. (pick ball24 room3 left)
   deleted: (at ball24 room3) (free left)
   added: (carry ball24 left)
   goals met: 13 of 27
18. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 13 of 27
19. (drop ball24 roomb left)
   deleted: (carry ball24 left)
   added: (at ball24 roomb) (free left)
   goals met: 14 of 27
20. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 14 of 27
21. (pick ball23 room3 left)
   deleted: (at ball23 room3) (free left)
   added: (carry ball23 left)
   goals met: 14 of 27
22. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 14 of 27
23. (drop ball23 roomb left)
   deleted: (carry ball23 left)
   added: (at ball23 roomb) (free left)
   goals met: 15 of 27
24. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 15 of 27
25. (pick ball22 room3 left)
   deleted: (at ball22 room3) (free left)
   added: (carry ball22 left)
   goals met: 15 of 27
26. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 15 of 27
27. (drop ball22 roomb left)
   deleted: (carry ball22 left)
   added: (at ball22 roomb) (free left)
   goals met: 16 of 27
28. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 16 of 27
29. (pick ball21 room3 left)
   deleted: (at ball21 room3) (free left)
   added: (carry ball21 left)
   goals met: 16 of 27
30. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 16 of 27
31. (drop ball21 roomb left)
   deleted: (carry ball21 left)
   added: (at ball21 roomb) (free left)
   goals met: 17 of 27
32. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 17 of 27
33. (pick ball20 room3 left)
   deleted: (at ball20 room3) (free left)
   added: (carry ball20 left)
   goals met: 17 of 27
34. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 17 of 27
35. (drop ball20 roomb left)
   deleted: (carry ball20 left)
   added: (at ball20 roomb) (free left)
   goals met: 18 of 27
36. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 18 of 27
37. (pick ball19 room3 left)
   deleted: (at ball19 room3) (free left)
   added: (carry ball19 left)
   goals met: 18 of 27
38. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 18 of 27
39. (drop ball19 roomb left)
   deleted: (carry ball19 left)
   added: (at ball19 roomb) (free left)
   goals met: 19 of 27
40. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 19 of 27
41. (pick ball18 room3 left)
   deleted: (at ball18 room3) (free left)
   added: (carry ball18 left)
   goals met: 19 of 27
42. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 19 of 27
43. (drop ball18 roomb left)
   deleted: (carry ball18 left)
   added: (at ball18 roomb) (free left)
   goals met: 20 of 27
44. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 20 of 27
45. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 20 of 27
46. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 20 of 27
47. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 21 of 27
48. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 21 of 27
49. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 21 of 27
50. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 21 of 27
51. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 22 of 27
52. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 22 of 27
53. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 22 of 27
54. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 27
55. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 23 of 27
56. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 23 of 27
57. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 23 of 27
58. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 23 of 27
59. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 24 of 27
60. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 27
61. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 24 of 27
62. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 27
63. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 25 of 27
64. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 27
65. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 25 of 27
66. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 25 of 27
67. (drop ball2 roomb left)
   deleted: (carry ball2 left)
   added: (at ball2 roomb) (free left)
   goals met: 26 of 27
68. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 27
69. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 26 of 27
70. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 27
71. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 27 of 27
